[
    {
        "entry_id": 1,
        "day": 1,
        "time": "22:00",
        "event": "The train departs. I sit in my cabin (Car 10, Room 2), waiting for the attendant to check rooms.",
        "reaction": "I'm planning to steal her passenger log after she passes."
    },
    {
        "entry_id": 2,
        "day": 1,
        "time": "22:50",
        "event": "The attendant reaches my car. She looks familiar. I quietly follow her to see where she goes.",
        "reaction": "Is she connected to Annie's case?"
    },
    {
        "entry_id": 3,
        "day": 1,
        "time": "23:15",
        "event": "She leaves the attendant's room in Car 9. I sneak in and grab the passenger log.",
        "reaction": "No one saw me. I need to find Marcus."
    },
    {
        "entry_id": 4,
        "day": 1,
        "time": "23:30",
        "event": "After some searching, I find Marcus’s cabin and take a photo of his info. I ditch the log in Car 10.",
        "reaction": "It’s time. I can’t let him get away."
    },
    {
        "entry_id": 5,
        "day": 1,
        "time": "00:05",
        "event": "With my knife ready, I sneak into Marcus’s room and stab him in the chest three times while he sleeps.",
        "reaction": "One for Angel, one for Mom, and one for myself."
    },
    {
        "entry_id": 6,
        "day": 1,
        "time": "00:08",
        "event": "I go to the restroom and wash the blood from the knife.",
        "reaction": "Stay calm. No one saw me."
    },
    {
        "entry_id": 7,
        "day": 1,
        "time": "00:10",
        "event": "I return to my cabin and hide the knife.",
        "reaction": "It’s over. I just need to act normal now."
    },
    {
        "entry_id": 8,
        "day": 1,
        "time": "00:15",
        "event": "Suddenly, a loud crash—then the train comes to a halt.",
        "reaction": "What happened? Did someone find the body already?"
    },
    {
        "entry_id": 9,
        "day": 2,
        "time": "06:06",
        "event": "Ethan channels his anger and grief into a rigorous morning workout in the train's gym.",
        "reaction": "The workout's physical exertion and adrenaline help Ethan focus on piecing together Marcus's death, his thirst for justice overpowering any fear of potential consequences."
    },
    {
        "entry_id": 10,
        "day": 2,
        "time": "14:18",
        "event": "Post-lunch, Ethan stealthily tails the dubious passengers in Carriage 9 to learn about Marcus and his companions.",
        "reaction": "Driven by his sister's murder and his mother's unfortunate demise, Ethan navigates the packed train, his heart pounding and mind focused on unearthing clues to Marcus's killer, despite the dangers."
    },
    {
        "entry_id": 11,
        "day": 2,
        "time": "18:58",
        "event": "Ethan positions himself near Marcus's cabin during dinner to spy and gather potential leads.",
        "reaction": "Ethan, driven by his family's tragic past and a thirst for justice, feels a rush of adrenaline as he risks conducting his covert investigation."
    },
    {
        "entry_id": 12,
        "day": 3,
        "time": "07:31",
        "event": "Ethan secretly tails the dubious passengers in Carriage 9 to learn more about Marcus and his crew.",
        "reaction": "Driven by memories of his sister and mother's tragic deaths, Ethan tenaciously navigates the busy train, determined to uncover the truth about Marcus's murder, despite the risks."
    },
    {
        "entry_id": 13,
        "day": 3,
        "time": "08:41",
        "event": "Ethan secretly trails the dubious passengers in Carriage 9 post-lunch to learn more about Marcus and his crew.",
        "reaction": "With a pounding heart, Ethan watches Carriage 9's passengers, his past losses and pursuit of justice fueling his alertness and fear of the unknown truth."
    },
    {
        "entry_id": 14,
        "day": 3,
        "time": "08:41 + exploration",
        "event": "Ethan discovered a wanted poster while exploring a journal.",
        "reaction": "Recognition of the poster stirred a determined yet sorrowful Ethan, as he recalled his sister's tragic kidnapping and murder by Marcus."
    },
    {
        "entry_id": 15,
        "day": 3,
        "time": "12:44",
        "event": "Ethan strategically dines near Marcus's cabin to eavesdrop and watch him for any useful information.",
        "reaction": "Ethan is a mix of determined and uneasy, haunted by past losses and the potential of what he might discover, as he intently observes Marcus for any clues to his quest for justice."
    }
]